## Student Engagement
Here we will explore the data on student engagement

In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import student_info
from collections import Counter

importing Jupyter notebook from Student_info.ipynb
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35230 entries, 0 to 35229
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   student_id       35230 non-null  int64
 1   student_country  35217 non-null  object
 2   date_registered  35230 non-null  object
dtypes: int64(1), object(2)
memory usage: 825.8+ KB

In [2]:
student_engagement = pd.read_csv('dataSets/365_database/365_student_engagement.csv')
student_engagement.head()

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged
0,1,274999,1,1,1,2022-05-27
1,3,274501,0,0,1,2022-05-27
2,4,272842,1,1,1,2022-05-27
3,8,275173,0,0,1,2022-05-27
4,11,274876,0,1,0,2022-05-27

In [3]:
dates = pd.DataFrame(student_engagement['date_engaged'].value_counts())
dates.head()

            date_engaged
2022-08-16           808
2022-08-15           807
2022-08-17           749
2022-08-18           585
2022-10-10           402

### Date of engagement
- The above dataframe contains dates which appear in the student engagement dataframe.

- They are listed in descending order of engagement (i.e) The top most date is when most engagement happened, second date - second most and so on.

In [5]:
students = pd.DataFrame(student_engagement['student_id'].value_counts())
students

        student_id
269204         155
261682         139
264131         134
261905         133
260173         130
...            ...
274637           1
274638           1
274640           1
274644           1
295443           1

[18344 rows x 1 columns]

### Student Engagement
- The above dataframe contains students who appear in the student engagement dataframe.

- They are listed in descending order of engagement (i.e) The top most student has engaged the most, second top - second most and so on.

In [8]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
missing_country

[261725,
 262665,
 272144,
 278827,
 282654,
 282914,
 283704,
 283791,
 284550,
 284790,
 286959,
 290648,
 293967]

In [9]:
df = student_engagement.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_engagement_cleaned = df_cleaned.reset_index(drop=True)
(student_engagement_cleaned)

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged
0,1,274999,1,1,1,2022-05-27
1,3,274501,0,0,1,2022-05-27
2,4,272842,1,1,1,2022-05-27
3,8,275173,0,0,1,2022-05-27
4,11,274876,0,1,0,2022-05-27
...,...,...,...,...,...,...
65320,2649439,295185,0,0,1,2022-10-20
65321,2649446,282935,0,1,1,2022-10-20
65322,2649658,292048,0,0,1,2022-10-20
65323,2649818,295443,0,0,1,2022-10-20
65324,2649873,284482,0,0,1,2022-10-20

In [10]:
country = []
i = 0
n = len(student_engagement_cleaned)-1

while (i<=n):
    x=student_engagement_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [11]:
len(country)
df_country = pd.DataFrame(country,columns = ['country'])
df_country

      country
0          TH
1          US
2          IN
3          NP
4          PK
...       ...
65320      AR
65321      BR
65322      CA
65323      GB
65324      US

[65325 rows x 1 columns]

In [12]:
frames = [student_engagement_cleaned, df_country]

student_engagement_by_country = pd.concat(frames,axis = 1)

student_engagement_by_country

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged,country
0,1,274999,1,1,1,2022-05-27,TH
1,3,274501,0,0,1,2022-05-27,US
2,4,272842,1,1,1,2022-05-27,IN
3,8,275173,0,0,1,2022-05-27,NP
4,11,274876,0,1,0,2022-05-27,PK
...,...,...,...,...,...,...,...
65320,2649439,295185,0,0,1,2022-10-20,AR
65321,2649446,282935,0,1,1,2022-10-20,BR
65322,2649658,292048,0,0,1,2022-10-20,CA
65323,2649818,295443,0,0,1,2022-10-20,GB
65324,2649873,284482,0,0,1,2022-10-20,US

In [13]:
student_ID_frequency = student_engagement_by_country['student_id'].value_counts()

ID_frequency = pd.DataFrame(student_ID_frequency).reset_index().rename(columns={"index": "student_id", "student_id": "frequency"})

ID_frequency

       student_id  frequency
0          269204        155
1          261682        139
2          264131        134
3          261905        133
4          260173        130
...           ...        ...
18330      262169          1
18331      272362          1
18332      279869          1
18333      280075          1
18334      295443          1

[18335 rows x 2 columns]

In [14]:
average_engagement = int(ID_frequency['frequency'].mean())

The above variable is an int representing the average level of engagement among students

In [15]:
above_avg = ID_frequency[ID_frequency['frequency']>=average_engagement].reset_index(drop=True)
below_avg = ID_frequency[ID_frequency['frequency']<average_engagement].reset_index(drop=True)
below_avg

      student_id  frequency
0         269204        155
1         261682        139
2         264131        134
3         261905        133
4         260173        130
...          ...        ...
4031      282183          3
4032      287369          3
4033      281362          3
4034      295250          3
4035      280534          3

[4036 rows x 2 columns]

We have now created two dataframe depicting student ID and engagement frequencies

They are above_avg and below_avg, the titles are pretty self-explanatory.

From this the student_engagement_cleaned dataframe could be split in two to study the nationality representation.

In [81]:
above_avg_student_id = above_avg['student_id'].tolist()
below_avg_student_id = below_avg['student_id'].tolist() 
print(above_avg_student_id[:10])
print(below_avg_student_id[:10])

[269204, 261682, 264131, 261905, 260173, 261466, 267064, 262569, 260465, 260754]
[267606, 293427, 293444, 270379, 293107, 269253, 293122, 278726, 269251, 282454]

In [26]:
above_avg_engagement = student_engagement_by_country[student_engagement_by_country['student_id'].isin(above_avg_student_id)].reset_index(drop = True)
above_avg_engagement

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged,country
0,1,274999,1,1,1,2022-05-27,TH
1,3,274501,0,0,1,2022-05-27,US
2,4,272842,1,1,1,2022-05-27,IN
3,8,275173,0,0,1,2022-05-27,NP
4,11,274876,0,1,0,2022-05-27,PK
...,...,...,...,...,...,...,...
48188,2649021,273630,0,0,1,2022-10-20,US
48189,2649283,292757,0,0,1,2022-10-20,EG
48190,2649446,282935,0,1,1,2022-10-20,BR
48191,2649658,292048,0,0,1,2022-10-20,CA
48192,2649873,284482,0,0,1,2022-10-20,US

The above DF contains information on students with above average level of engagement activity

In [80]:
below_avg_engagement = student_engagement_by_country[student_engagement_by_country['student_id'].isin(below_avg_student_id)].reset_index(drop = True)
(below_avg_engagement)

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged,country
0,319,259098,1,0,1,2022-05-27,IN
1,513,275178,0,0,1,2022-05-27,EG
2,562,274919,0,1,1,2022-05-27,TR
3,699,275180,1,1,1,2022-05-27,ID
4,893,275184,0,0,1,2022-05-27,GB
...,...,...,...,...,...,...,...
17127,2649150,295512,1,0,1,2022-10-20,CA
17128,2649152,281652,0,0,1,2022-10-20,ID
17129,2649377,293992,0,0,1,2022-10-20,GB
17130,2649439,295185,0,0,1,2022-10-20,AR
17131,2649818,295443,0,0,1,2022-10-20,GB

The above DF contains information on students with below average level of engagement activity

Next step is understanding the nationality representation in these DataFrames discounting the repetition of student IDs.

For that purpose, <mark> drop_duplicates() </mark> function will be used to remove duplicate rows based on the country column.

In [32]:
print(len(above_avg_engagement['student_id'].value_counts()))
print(len(below_avg_engagement['student_id'].value_counts()))

4036
14299

In [78]:
above_avg_students = above_avg_engagement.drop_duplicates(subset = ['student_id']).reset_index(drop =True)
below_avg_students = below_avg_engagement.drop_duplicates(subset = ['student_id']).reset_index(drop =True)

# The above lines of codes frame data on engagement without repetition in the student ID.
# This is useful -seen below- in extracting data to represent nationality based on engagement.

above_avg_countries = above_avg_students['country'].value_counts().to_dict()
below_avg_countries = below_avg_students['country'].value_counts().to_dict()

# The dictionaries described above will be exported to different notebooks to be further utilized.

len(above_avg_countries)
len(below_avg_countries)

169

In [86]:
above_avg_ID = above_avg_engagement['student_id'].value_counts().to_dict()
# below_avg_engagement
above_avg_ID

{269204: 155,
 261682: 139,
 264131: 134,
 261905: 133,
 260173: 130,
 261466: 128,
 267064: 125,
 262569: 124,
 260465: 124,
 260754: 121,
 268926: 121,
 264146: 120,
 261412: 119,
 259767: 117,
 268293: 114,
 261785: 112,
 268985: 111,
 268011: 111,
 271991: 108,
 268287: 108,
 266512: 107,
 271326: 104,
 259283: 103,
 263293: 102,
 271519: 101,
 260345: 101,
 263076: 101,
 261778: 100,
 266001: 100,
 271154: 100,
 259174: 98,
 277084: 97,
 274861: 95,
 262641: 93,
 273060: 92,
 262643: 91,
 260998: 91,
 265092: 89,
 276439: 88,
 263087: 88,
 260593: 88,
 261777: 88,
 272909: 88,
 268242: 87,
 266766: 87,
 261801: 85,
 269314: 85,
 267916: 84,
 270671: 84,
 275449: 83,
 261756: 83,
 275045: 82,
 268990: 82,
 266012: 82,
 262988: 81,
 280121: 81,
 261212: 81,
 277864: 78,
 275277: 77,
 258818: 77,
 266758: 76,
 261550: 76,
 265101: 76,
 259106: 75,
 272596: 75,
 268764: 75,
 262580: 75,
 263496: 74,
 263690: 74,
 271185: 73,
 270606: 73,
 264404: 73,
 262112: 73,
 277609: 72,
 277499: 72,
 265588: 71,
 264295: 71,
 262459: 71,
 260608: 70,
 269054: 70,
 270042: 70,
 260042: 70,
 275624: 69,
 284438: 69,
 259860: 69,
 271015: 69,
 272965: 69,
 269741: 68,
 265966: 67,
 268357: 66,
 280548: 66,
 274498: 66,
 282977: 65,
 259657: 65,
 260168: 65,
 277353: 65,
 261735: 65,
 270075: 64,
 261121: 64,
 263321: 64,
 273423: 63,
 269570: 63,
 278283: 62,
 265928: 61,
 275637: 61,
 259429: 60,
 261073: 60,
 266529: 60,
 277398: 59,
 261263: 59,
 279228: 59,
 260968: 59,
 282954: 59,
 260649: 59,
 270738: 59,
 267959: 58,
 266332: 58,
 274070: 57,
 272029: 57,
 268410: 57,
 277866: 57,
 272510: 57,
 277403: 56,
 265415: 56,
 278764: 56,
 272842: 56,
 268978: 56,
 278875: 56,
 261647: 56,
 286826: 55,
 262585: 55,
 280613: 55,
 265250: 55,
 261171: 55,
 274564: 55,
 260813: 54,
 278611: 54,
 267898: 54,
 268825: 54,
 268331: 54,
 274209: 54,
 260910: 53,
 266187: 53,
 268922: 53,
 266693: 53,
 269518: 53,
 263759: 53,
 272991: 52,
 261446: 52,
 267026: 52,
 263650: 51,
 266548: 51,
 259011: 51,
 259524: 51,
 271543: 50,
 285352: 50,
 261019: 50,
 272838: 50,
 275286: 50,
 259504: 50,
 284482: 50,
 261802: 50,
 274798: 49,
 279482: 49,
 264425: 49,
 282542: 49,
 269549: 49,
 278055: 49,
 270930: 48,
 273841: 48,
 288269: 48,
 278851: 48,
 265970: 48,
 275276: 48,
 271903: 48,
 280868: 48,
 261820: 47,
 275468: 47,
 276788: 47,
 271800: 47,
 259959: 47,
 259996: 47,
 273936: 46,
 275100: 46,
 267203: 46,
 277562: 46,
 274781: 46,
 274825: 46,
 261239: 45,
 260356: 45,
 287143: 45,
 274996: 45,
 282121: 45,
 282839: 45,
 265967: 45,
 280249: 45,
 275173: 45,
 269646: 45,
 279738: 44,
 282591: 44,
 259258: 44,
 277590: 44,
 283696: 44,
 263480: 44,
 274050: 44,
 260572: 44,
 260549: 44,
 275129: 44,
 266614: 44,
 275470: 44,
 261737: 43,
 276783: 43,
 264476: 43,
 268989: 43,
 259262: 43,
 271950: 43,
 282739: 43,
 287565: 43,
 268152: 43,
 282430: 42,
 263825: 42,
 268827: 42,
 281608: 42,
 263309: 42,
 268892: 42,
 267936: 42,
 276562: 42,
 264400: 42,
 275442: 42,
 265878: 42,
 273671: 42,
 274906: 42,
 285406: 42,
 271664: 42,
 261626: 42,
 262792: 42,
 265310: 42,
 267812: 41,
 263661: 41,
 284531: 41,
 258913: 41,
 262784: 41,
 262714: 41,
 276510: 41,
 271035: 41,
 282304: 41,
 266788: 40,
 275590: 40,
 281095: 40,
 282687: 40,
 262414: 40,
 261668: 40,
 269040: 40,
 267643: 39,
 264826: 39,
 264049: 39,
 282986: 39,
 269541: 39,
 268473: 39,
 279508: 38,
 281753: 38,
 269064: 38,
 261813: 38,
 262412: 38,
 270460: 38,
 276784: 38,
 283824: 38,
 281609: 38,
 282291: 38,
 260980: 38,
 278459: 37,
 288345: 37,
 263531: 37,
 274536: 37,
 264081: 37,
 264684: 37,
 281294: 37,
 289047: 37,
 262599: 36,
 261072: 36,
 270179: 36,
 272472: 36,
 259884: 36,
 284180: 36,
 285397: 36,
 284066: 36,
 284266: 36,
 260865: 36,
 282601: 36,
 277508: 36,
 263197: 36,
 262817: 35,
 275307: 35,
 271348: 35,
 281671: 35,
 285411: 35,
 274552: 35,
 261519: 35,
 289270: 35,
 261567: 35,
 265628: 35,
 278753: 35,
 272452: 35,
 288637: 35,
 277242: 35,
 266095: 34,
 260646: 34,
 262377: 34,
 283406: 34,
 260200: 34,
 262270: 34,
 278789: 34,
 261766: 34,
 267106: 34,
 267765: 34,
 261393: 34,
 265337: 34,
 264916: 34,
 272586: 34,
 261828: 34,
 261593: 34,
 268584: 34,
 267558: 33,
 276130: 33,
 270988: 33,
 291116: 33,
 267721: 33,
 263579: 33,
 283029: 33,
 263693: 33,
 272261: 33,
 272717: 33,
 282901: 32,
 278129: 32,
 266340: 32,
 268516: 32,
 260815: 32,
 261522: 32,
 282935: 32,
 265317: 32,
 281522: 32,
 266112: 32,
 271338: 32,
 280814: 32,
 259870: 32,
 259865: 32,
 260916: 32,
 261819: 32,
 269959: 32,
 290746: 32,
 287490: 32,
 278881: 32,
 274433: 32,
 260486: 32,
 272865: 31,
 284152: 31,
 276938: 31,
 260952: 31,
 264228: 31,
 261810: 31,
 272283: 31,
 264259: 31,
 279264: 31,
 282066: 31,
 263683: 31,
 275132: 31,
 265653: 31,
 269874: 31,
 291462: 31,
 281870: 31,
 270616: 31,
 263786: 31,
 262596: 30,
 265519: 30,
 268374: 30,
 282758: 30,
 280067: 30,
 272425: 30,
 268045: 30,
 260971: 30,
 264623: 30,
 280552: 30,
 261417: 30,
 268389: 30,
 285322: 30,
 280412: 30,
 274039: 30,
 261288: 30,
 268811: 30,
 265093: 30,
 275552: 30,
 282915: 30,
 260684: 30,
 259952: 30,
 274572: 30,
 274460: 30,
 265572: 29,
 267010: 29,
 288315: 29,
 284530: 29,
 282507: 29,
 282371: 29,
 270009: 29,
 263392: 29,
 263479: 29,
 281925: 29,
 265110: 29,
 282273: 29,
 268090: 29,
 284954: 29,
 261390: 29,
 280324: 29,
 261510: 29,
 278788: 29,
 277322: 29,
 278701: 29,
 279562: 29,
 260954: 29,
 274576: 29,
 258800: 29,
 259026: 29,
 261004: 29,
 263913: 28,
 268805: 28,
 261771: 28,
 291769: 28,
 261491: 28,
 261495: 28,
 277066: 28,
 262224: 28,
 291789: 28,
 280193: 28,
 260126: 28,
 278582: 28,
 273992: 28,
 266616: 28,
 270599: 28,
 282575: 28,
 272058: 28,
 261670: 28,
 282318: 28,
 277238: 28,
 265449: 28,
 264514: 28,
 260477: 28,
 283745: 28,
 291706: 27,
 269984: 27,
 267286: 27,
 282088: 27,
 267488: 27,
 271761: 27,
 281993: 27,
 274162: 27,
 280233: 27,
 262761: 27,
 288909: 27,
 290496: 27,
 267011: 27,
 281440: 27,
 268796: 27,
 275479: 27,
 269540: 27,
 282751: 27,
 276420: 27,
 267854: 26,
 283239: 26,
 278586: 26,
 262634: 26,
 287334: 26,
 280644: 26,
 286717: 26,
 259938: 26,
 270367: 26,
 261790: 26,
 261714: 26,
 260861: 26,
 269013: 26,
 261693: 26,
 274814: 26,
 261590: 26,
 263798: 26,
 268113: 26,
 274163: 26,
 274611: 26,
 286834: 26,
 282033: 26,
 279409: 26,
 291425: 25,
 262754: 25,
 273300: 25,
 282442: 25,
 268390: 25,
 291487: 25,
 282408: 25,
 273068: 25,
 261972: 25,
 275529: 25,
 268556: 25,
 259533: 25,
 268263: 25,
 263368: 25,
 273486: 25,
 271140: 25,
 261374: 25,
 262406: 25,
 274130: 25,
 261658: 25,
 272359: 25,
 274994: 25,
 259300: 25,
 264746: 24,
 260977: 24,
 264761: 24,
 284072: 24,
 260915: 24,
 278642: 24,
 260616: 24,
 266418: 24,
 260321: 24,
 280019: 24,
 271925: 24,
 280853: 24,
 280611: 24,
 278280: 24,
 260702: 24,
 276671: 24,
 281796: 24,
 280772: 24,
 283576: 24,
 259953: 24,
 263494: 24,
 263120: 23,
 261644: 23,
 261086: 23,
 277012: 23,
 258845: 23,
 261552: 23,
 268800: 23,
 270833: 23,
 284487: 23,
 260192: 23,
 260111: 23,
 284241: 23,
 264076: 23,
 278906: 23,
 277886: 23,
 284858: 23,
 279352: 23,
 273126: 23,
 269975: 23,
 271300: 23,
 268962: 23,
 282610: 23,
 264361: 23,
 269934: 23,
 280134: 23,
 263000: 23,
 279468: 23,
 271851: 23,
 277410: 23,
 292406: 23,
 292596: 22,
 282726: 22,
 292572: 22,
 263456: 22,
 268510: 22,
 286799: 22,
 267949: 22,
 278927: 22,
 267496: 22,
 260132: 22,
 262908: 22,
 287975: 22,
 283005: 22,
 275050: 22,
 277557: 22,
 267813: 22,
 270658: 22,
 281742: 22,
 275741: 22,
 284379: 22,
 275554: 22,
 269010: 22,
 262068: 22,
 288884: 22,
 277825: 22,
 266754: 22,
 288809: 22,
 270240: 22,
 275677: 22,
 276490: 22,
 269519: 22,
 263118: 22,
 261337: 22,
 260850: 22,
 278177: 21,
 261817: 21,
 274382: 21,
 274475: 21,
 280379: 21,
 258862: 21,
 263791: 21,
 262457: 21,
 268863: 21,
 273136: 21,
 281413: 21,
 275158: 21,
 282829: 21,
 292650: 21,
 270263: 21,
 261680: 21,
 290843: 21,
 270393: 21,
 268883: 21,
 267885: 21,
 261685: 21,
 270710: 21,
 261753: 21,
 282926: 21,
 266725: 21,
 279909: 21,
 272437: 21,
 278421: 21,
 269066: 21,
 288793: 21,
 266584: 21,
 276135: 21,
 261184: 21,
 268352: 21,
 264954: 21,
 289024: 21,
 260329: 21,
 285776: 21,
 280372: 21,
 261336: 21,
 267235: 21,
 260829: 21,
 283510: 21,
 264637: 21,
 266814: 20,
 264472: 20,
 267114: 20,
 283154: 20,
 258971: 20,
 259268: 20,
 283730: 20,
 284194: 20,
 271856: 20,
 265685: 20,
 265176: 20,
 275165: 20,
 274347: 20,
 284141: 20,
 283300: 20,
 276998: 20,
 282595: 20,
 261408: 20,
 260211: 20,
 282594: 20,
 270036: 20,
 273580: 20,
 281900: 20,
 269744: 20,
 273846: 20,
 263648: 20,
 261452: 20,
 269220: 20,
 275583: 20,
 280547: 20,
 262821: 20,
 261979: 20,
 290353: 20,
 281453: 20,
 271896: 20,
 281299: 20,
 270744: 20,
 261809: 20,
 289177: 20,
 261359: 19,
 261323: 19,
 259483: 19,
 264572: 19,
 263231: 19,
 271243: 19,
 282402: 19,
 282283: 19,
 276455: 19,
 275033: 19,
 282560: 19,
 258984: 19,
 282462: 19,
 259070: 19,
 288923: 19,
 270474: 19,
 275684: 19,
 272887: 19,
 274057: 19,
 287473: 19,
 269526: 19,
 282813: 19,
 281331: 19,
 259727: 19,
 287688: 19,
 274645: 19,
 292491: 19,
 270022: 19,
 280345: 19,
 282940: 19,
 274908: 19,
 263497: 19,
 258803: 19,
 282838: 19,
 289244: 19,
 282643: 19,
 269924: 18,
 280330: 18,
 290444: 18,
 291098: 18,
 265003: 18,
 261325: 18,
 274791: 18,
 280821: 18,
 269872: 18,
 289567: 18,
 275282: 18,
 289517: 18,
 290953: 18,
 261391: 18,
 265808: 18,
 289805: 18,
 274901: 18,
 266057: 18,
 287330: 18,
 277285: 18,
 268896: 18,
 273630: 18,
 268618: 18,
 282706: 18,
 291401: 18,
 268714: 18,
 267443: 18,
 276598: 18,
 263783: 18,
 272570: 18,
 263065: 18,
 283636: 18,
 282564: 18,
 278972: 18,
 292641: 18,
 277964: 18,
 262819: 18,
 269000: 18,
 272199: 18,
 277953: 18,
 268129: 18,
 277845: 18,
 269070: 18,
 270700: 17,
 281196: 17,
 278716: 17,
 268465: 17,
 271114: 17,
 271465: 17,
 268257: 17,
 278115: 17,
 269937: 17,
 282776: 17,
 280148: 17,
 283452: 17,
 270098: 17,
 276112: 17,
 272001: 17,
 283887: 17,
 269110: 17,
 266477: 17,
 269485: 17,
 276104: 17,
 272255: 17,
 266731: 17,
 275510: 17,
 282638: 17,
 275389: 17,
 279404: 17,
 272696: 17,
 272879: 17,
 268718: 17,
 282586: 17,
 276887: 17,
 280427: 17,
 272157: 17,
 275566: 17,
 292815: 17,
 282629: 17,
 263639: 17,
 292402: 17,
 291566: 17,
 262992: 17,
 264306: 17,
 291606: 17,
 263564: 17,
 261523: 17,
 292574: 17,
 288691: 17,
 263112: 17,
 264549: 17,
 292625: 17,
 258956: 17,
 291577: 17,
 292033: 17,
 262273: 17,
 270596: 16,
 263388: 16,
 292436: 16,
 261059: 16,
 261022: 16,
 281370: 16,
 275567: 16,
 275126: 16,
 288284: 16,
 264696: 16,
 266743: 16,
 290242: 16,
 259494: 16,
 278833: 16,
 289796: 16,
 274948: 16,
 287632: 16,
 269769: 16,
 269771: 16,
 281787: 16,
 260291: 16,
 273329: 16,
 293005: 16,
 293324: 16,
 263307: 16,
 275518: 16,
 293156: 16,
 261293: 16,
 293207: 16,
 264290: 16,
 267498: 16,
 282443: 16,
 259305: 16,
 267487: 16,
 270931: 16,
 286418: 16,
 282705: 16,
 272089: 16,
 275574: 16,
 262487: 15,
 278444: 15,
 289802: 15,
 282640: 15,
 282446: 15,
 282637: 15,
 269671: 15,
 277834: 15,
 277821: 15,
 272906: 15,
 277791: 15,
 278344: 15,
 292129: 15,
 269653: 15,
 282553: 15,
 274273: 15,
 292151: 15,
 264732: 15,
 263008: 15,
 264699: 15,
 287063: 15,
 286529: 15,
 293083: 15,
 260181: 15,
 282207: 15,
 269492: 15,
 278326: 15,
 272436: 15,
 268348: 15,
 258922: 15,
 270486: 15,
 291744: 15,
 268409: 15,
 266738: 15,
 266316: 15,
 265686: 15,
 261608: 15,
 259654: 15,
 274723: 15,
 281339: 15,
 284028: 15,
 270607: 15,
 280031: 15,
 271837: 15,
 265044: 15,
 280218: 15,
 280207: 15,
 261173: 15,
 268558: 15,
 259549: 15,
 258822: 15,
 259506: 15,
 270957: 15,
 270725: 15,
 260792: 15,
 263672: 15,
 268420: 15,
 278216: 14,
 268600: 14,
 275548: 14,
 282803: 14,
 291400: 14,
 272173: 14,
 269864: 14,
 263859: 14,
 264348: 14,
 291053: 14,
 261554: 14,
 282779: 14,
 280142: 14,
 264253: 14,
 260029: 14,
 284643: 14,
 265370: 14,
 259969: 14,
 265578: 14,
 268641: 14,
 272504: 14,
 259777: 14,
 270911: 14,
 292191: 14,
 261674: 14,
 261558: 14,
 261773: 14,
 259039: 14,
 260891: 14,
 267919: 14,
 291945: 14,
 282032: 14,
 292882: 14,
 266811: 14,
 289432: 14,
 278940: 14,
 289655: 14,
 283809: 14,
 291823: 14,
 272395: 14,
 290945: 14,
 277419: 14,
 269617: 14,
 275103: 14,
 289019: 14,
 261690: 14,
 283166: 14,
 266901: 14,
 284292: 14,
 262237: 14,
 285670: 14,
 258865: 14,
 274087: 14,
 286607: 14,
 262677: 14,
 293564: 14,
 288003: 13,
 259019: 13,
 277384: 13,
 292819: 13,
 292939: 13,
 292585: 13,
 263300: 13,
 286199: 13,
 270193: 13,
 260929: 13,
 290206: 13,
 261750: 13,
 279735: 13,
 281096: 13,
 280850: 13,
 277782: 13,
 261585: 13,
 271792: 13,
 280159: 13,
 261349: 13,
 261364: 13,
 280346: 13,
 272977: 13,
 289798: 13,
 275757: 13,
 260787: 13,
 289985: 13,
 280689: 13,
 271371: 13,
 292114: 13,
 282697: 13,
 260578: 13,
 277556: 13,
 275422: 13,
 269050: 13,
 269016: 13,
 268923: 13,
 ...}

# Deprecated

Number of unique Student IDs in the engagement data.

From the above two cells it is clear that there are numerous repeated values in the Student ID column.

Some students must be engaging on the platform repetitively.

I will use the Counter() function from the collection package to create a dict with Student ID as the key and the number of times they occur as the value.

From that the average of instances of engagement could be calculated which help narrow the student population to study (most engaged).

#### Update

The same result can be achieved by applying the <mark>value_counts()</mark> on the 'student_id' column of the original dataframe.

I will comment the code but keep them to remind myself when I look through this in the future.

In [70]:
# l = student_engagement_by_country['student_id'].tolist()
# ID_occurrence = Counter(l)
# len(ID_occurrence)

<mark> ID_occurence </mark> from the above cell contains the dict containing Student IDs as keys and their frequency of occurence as the values.

This dict could be converted to a data frame to study the statistical distribution.

In [71]:
# student_engagement_frequency = pd.DataFrame.from_dict(ID_occurrence,orient ='index' ).reset_index().rename(columns={"index": "student_id", 0: "frequency"})

# student_engagement_frequency

From the DF above we can study the distribution of engagement.